/*==============================================================*/
/* DBMS name:      ORACLE Version 11g                           */
/* Created on:     2018/6/7 17:33:40                            */
/*==============================================================*/

/*==============================================================*/
/* Table: 储蓄开户                                                  */
/*==============================================================*/
create table 储蓄开户 
(
   身份证号                 nvarchar2(20)             not null,
   名字                   nvarchar2(20)             not null,
   账户号                  INTEGER              not null,
   最近访问日期               DATE,
   constraint PK_储蓄开户 primary key (身份证号, 名字, 账户号)
);

/*==============================================================*/
/* Index: 储蓄开户_FK                                               */
/*==============================================================*/
create index 储蓄开户_FK on 储蓄开户 (
   身份证号 ASC
);

/*==============================================================*/
/* Index: 储蓄开户2_FK                                              */
/*==============================================================*/
create index 储蓄开户2_FK on 储蓄开户 (
   名字 ASC
);

/*==============================================================*/
/* Index: 储蓄开户3_FK                                              */
/*==============================================================*/
create index 储蓄开户3_FK on 储蓄开户 (
   账户号 ASC
);

/*==============================================================*/
/* Table: 储蓄账户                                                  */
/*==============================================================*/
create table 储蓄账户 
(
   账户号                  INTEGER              not null,
   开户日期                 DATE,
   余额                   NUMBER(8,2),
   货币类型                 nvarchar2(50),
   利率                   FLOAT,
   constraint PK_储蓄账户 primary key (账户号)
);

/*==============================================================*/
/* Table: 员工                                                    */
/*==============================================================*/
create table 员工 
(
   身份证号Y               nvarchar2(20)             not null,
   员工_身份证号Y            nvarchar2(20),
   姓名Y                  nvarchar2(50),
   电话号码Y                nvarchar2(50),
   家庭住址Y                nvarchar2(50),
   开始工作日期              DATE,
   constraint PK_员工 primary key (身份证号Y)
);

/*==============================================================*/
/* Index: 领导_FK                                                 */
/*==============================================================*/
create index 领导_FK on 员工 (
   员工_身份证号Y ASC
);

/*==============================================================*/
/* Table: 客户                                                    */
/*==============================================================*/
create table 客户 
(
   身份证号                 nvarchar2(20)             not null,
   身份证号Y                nvarchar2(20),
   姓名                   nvarchar2(50),
   联系电话                 nvarchar2(50),
   家庭住址                 nvarchar2(50),
   联系人姓名                nvarchar2(50)                 not null,
   联系人手机号               nvarchar2(50),
   联系人Email           nvarchar2(50),
   联系人与客户关系             nvarchar2(50),
   负责人类型                nvarchar2(50),
   constraint PK_客户 primary key (身份证号)
);

/*==============================================================*/
/* Index: 负责_FK                                                 */
/*==============================================================*/
create index 负责_FK on 客户 (
   身份证号Y ASC
);

/*==============================================================*/
/* Table: 拥有5                                                   */
/*==============================================================*/
create table 拥有5 
(
   贷款号                  INTEGER              not null,
   身份证号                 nvarchar2(20)             not null,
   constraint PK_拥有5 primary key (贷款号, 身份证号)
);

/*==============================================================*/
/* Index: 拥有5_FK                                                */
/*==============================================================*/
create index 拥有5_FK on 拥有5 (
   贷款号 ASC
);

/*==============================================================*/
/* Index: 拥有6_FK                                                */
/*==============================================================*/
create index 拥有6_FK on 拥有5 (
   身份证号 ASC
);

/*==============================================================*/
/* Table: 支付情况                                                  */
/*==============================================================*/
create table 支付情况 
(
   贷款号                  INTEGER              not null,
   身份证号                 nvarchar2(20)             not null,
   金额1                  NUMBER(8,2),
   日期付款                 DATE,
   constraint PK_支付情况 primary key (贷款号, 身份证号)
);

/*==============================================================*/
/* Index: 支付情况_FK                                               */
/*==============================================================*/
create index 支付情况_FK on 支付情况 (
   贷款号 ASC
);

/*==============================================================*/
/* Index: 支付情况2_FK                                              */
/*==============================================================*/
create index 支付情况2_FK on 支付情况 (
   身份证号 ASC
);

/*==============================================================*/
/* Table: 支行                                                    */
/*==============================================================*/
create table 支行 
(
   城市                   nvarchar2(20)             not null,
   名字                   nvarchar2(20)             not null,
   资产                   NUMBER(8,2)          not null,
   constraint PK_支行 primary key (名字)
);

/*==============================================================*/
/* Table: 账户                                                    */
/*==============================================================*/
create table 账户 
(
   账户号                  INTEGER              not null,
   开户日期                 DATE,
   余额                   NUMBER(8,2),
   constraint PK_账户 primary key (账户号)
);

/*==============================================================*/
/* Table: 贷款                                                    */
/*==============================================================*/
create table 贷款 
(
   金额1                  NUMBER(8,2),
   贷款号                  INTEGER              not null,
   名字                   nvarchar2(20),
   constraint PK_贷款 primary key (贷款号)
);

/*==============================================================*/
/* Index: 拥有贷款_FK                                               */
/*==============================================================*/
create index 拥有贷款_FK on 贷款 (
   名字 ASC
);

/*==============================================================*/
/* Table: 贷款开户                                                  */
/*==============================================================*/
create table 贷款开户 
(
   身份证号                 nvarchar2(20)             not null,
   名字                   nvarchar2(20)             not null,
   账户号                  INTEGER              not null,
   最近访问日期_贷款            DATE,
   constraint PK_贷款开户 primary key (身份证号, 名字, 账户号)
);

/*==============================================================*/
/* Index: 贷款开户_FK                                               */
/*==============================================================*/
create index 贷款开户_FK on 贷款开户 (
   身份证号 ASC
);

/*==============================================================*/
/* Index: 贷款开户2_FK                                              */
/*==============================================================*/
create index 贷款开户2_FK on 贷款开户 (
   名字 ASC
);

/*==============================================================*/
/* Index: 贷款开户3_FK                                              */
/*==============================================================*/
create index 贷款开户3_FK on 贷款开户 (
   账户号 ASC
);

/*==============================================================*/
/* Table: 贷款账户                                                  */
/*==============================================================*/
create table 贷款账户 
(
   账户号                  INTEGER              not null,
   开户日期                 DATE,
   余额                   NUMBER(8,2),
   透支额                  NUMBER(8,2),
   constraint PK_贷款账户 primary key (账户号)
);

alter table 储蓄开户
   add constraint FK_储蓄开户_储蓄开户_客户 foreign key (身份证号)
      references 客户 (身份证号);

alter table 储蓄开户
   add constraint FK_储蓄开户_储蓄开户2_支行 foreign key (名字)
      references 支行 (名字);

alter table 储蓄开户
   add constraint FK_储蓄开户_储蓄开户3_储蓄账户 foreign key (账户号)
      references 储蓄账户 (账户号);

alter table 储蓄账户
   add constraint FK_储蓄账户_INHERITAN_账户 foreign key (账户号)
      references 账户 (账户号);

alter table 员工
   add constraint FK_员工_领导_员工 foreign key (员工_身份证号Y)
      references 员工 (身份证号Y);

alter table 客户
   add constraint FK_客户_负责_员工 foreign key (身份证号Y)
      references 员工 (身份证号Y);

alter table 拥有5
   add constraint FK_拥有5_拥有5_贷款 foreign key (贷款号)
      references 贷款 (贷款号);

alter table 拥有5
   add constraint FK_拥有5_拥有6_客户 foreign key (身份证号)
      references 客户 (身份证号);

alter table 支付情况
   add constraint FK_支付情况_支付情况_贷款 foreign key (贷款号)
      references 贷款 (贷款号);

alter table 支付情况
   add constraint FK_支付情况_支付情况2_客户 foreign key (身份证号)
      references 客户 (身份证号);

alter table 贷款
   add constraint FK_贷款_拥有贷款_支行 foreign key (名字)
      references 支行 (名字);

alter table 贷款开户
   add constraint FK_贷款开户_贷款开户_客户 foreign key (身份证号)
      references 客户 (身份证号);

alter table 贷款开户
   add constraint FK_贷款开户_贷款开户2_支行 foreign key (名字)
      references 支行 (名字);

alter table 贷款开户
   add constraint FK_贷款开户_贷款开户3_贷款账户 foreign key (账户号)
      references 贷款账户 (账户号);

alter table 贷款账户
   add constraint FK_贷款账户_INHERITAN_账户 foreign key (账户号)
      references 账户 (账户号);

