insert into 员工 values('440566199611230024', '440566199611230024',
 '刘六', '055183256412', '安徽省合肥市蜀山区金寨路78号', to_date('2011-04-09', 'yyyy-mm-dd'));
insert into 员工 values('165341199812240012', '440566199611230024',
'周霸霸', '054683214569', '上海市徐汇区虹桥路56号', to_date('2012-03-15', 'yyyy-mm-dd'));
insert into 员工 values('123456198905010032', '440566199611230024',
'齐德龙', '051283463476', '北京市朝阳区体育馆路101号', to_date('2013-07-16', 'yyyy-mm-dd'));
insert into 员工 values('165341198604230045', '440566199611230024',
'李顺', '054684521566', '上海市黄浦区南京路12号', to_date('2007-12-13','yyyy-mm-dd'));
insert into 员工 values('452334197809270053', '440566199611230024',
'郑九', '051283125694', '北京市海淀区永定路32号', to_date('2008-08-16', 'yyyy-mm-dd'));
insert into 员工 values('123456194910010321', '440566199611230024',
'高洁', '032182365145', '江苏省南京市栖霞区营苑北路11号', to_date('2009-08-16', 'yyyy-mm-dd'));
commit;
