/*客户*/
insert into 客户 values('440566196806300023', '440566199611230024',
'张三', '055188964521', '安徽省合肥市蜀山区金寨路11号', '张无忌', '13256978452',
'zhwj@ustc.edu.cn', '父子','贷款负责人');
insert into 客户 values('165341197503090012', '165341199812240012',
'王老吉'， '054689635121', '上海市徐汇区虹桥路17号', '王老五', '13456228896',
'zlj@163.com', '兄弟', '银行账户负责人');
insert into 客户 values('123456198502160014', '123456198905010032',
'罗永浩'， '051286954732', '北京市朝阳区二龙路101号', '史珍香'， '17543395923',
'lyh@126.com', '夫妻', '贷款负责人');
insert into 客户 values('165341198604230045', '165341198604230045',
'孙尚香', '054689566312', '上海市黄浦区延安东路123号', '孙权', '18723654987', 
'ssx@gmail.com', '兄妹',  '银行账户负责人'）;
insert into 客户 values('452334198510290032', '452334197809270053',
'谢娜', '051283256925', '北京市海淀区海淀街道95号', '张杰', '18753296421',
'xn@163.com', '夫妻', '贷款负责人');
insert into 客户 values('123456197502102542', '123456194910010321',
'赵四', '032160322012', '江苏省南京市玄武区五四路75号', '刘玲', '13562895443',
'zs@126.com', '母子', '银行账户负责人');
commit;
